{
    "sections": [
        {
            "header": "Comparing Linux to other OSs",
            "text": [
                "Linux operates much differently compared to other OSs. Important things to look for when comparing OSs are what exactly the OS is being used for, what kind of personalization is required, and many other valuable things."
            ]
        },
        {
            "header": "Linux VS Mac OS and Windows",
            "text": [
                "Linux distributions are free of cost unlike the Mac OS and Windows OS", "Linux offers high security and privacy when compared to the other two. A lot of people you make viruses focus them on Windows and Macs since overall Windows and Mac users aren’t as knowledgeable about how to deal with them, or prevent getting them in the first place. Windows and Mac operating systems set you as an admin right away which is how viruses can destroy your system. With Linux you can set yourself on a lower status from the get go so that if a virus does get in, it can’t do as much damage.",
                "Privacy is also where Linux shines over Windows and Macs. Apple and Microsoft collect a lot of data about its users which they can’t do much about but with Linux there is no company behind its operating systems to collect that data.", 
                "Since Linux is open source you could go into its source code and change it to your liking. Windows and Macs are owned by private companies which means they won’t let anyone besides them near their source code.", "Linux has many distributions that are built off the Linux kernel. When you choose Linux you get to pick a distributions to fit your needs.", "Linux has a massive community support. If you have a problem with Linux you can easily go online and learn how to fix it due to the giant community of people helping each other out. If you had a problem with Windows or Macs, you’d have to pay someone that has access to their source code to fix your issue."
            ],
            "link": "https://www.gadget-rumours.com/5-reasons-why-you-should-choose-linux-over-windows-or-mac-os/"
        }
    ]
}